README.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Description</a></li>
<li><a href="#sec-2">2. Feature Backlog</a>
<ul>
<li><a href="#sec-2-1">2.1. [<span class="timestamp-wrapper"><span class="timestamp">&lt;2017-09-20 Wed&gt;</span></span>] ~ 10 hours in</a></li>
</ul>
</li>
</ul>
</div>
</div>

# Description<a id="sec-1" name="sec-1"></a>

Find it hard to co-ordinate with your friend's busy class schedule? If you're a UBC student, you're in luck! Simply download you and your friend's iCal.ics and compare them here!

# Feature Backlog<a id="sec-2" name="sec-2"></a>

## [<span class="timestamp-wrapper"><span class="timestamp">&lt;2017-09-20 Wed&gt;</span></span>] ~ 10 hours in<a id="sec-2-1" name="sec-2-1"></a>

-   Simple user interface, with uploads using ng2-file-upload and FormData post methods
-   Express backend with Multer parser to manipulate .ics data
-   Display component renders the service response by subscription